import "./App.css";

const data = {
  surname: "Барановський",
  name: "Даніїл",
  direction: "Фронтенд",
  certification: "W3C",
  argumentation:
    "Підхід до фронтенду є важливим, тому що залежно від того, як він розроблений, користувачі можуть отримати хороший досвід взаємодії з веб-сайтом або ні. Я хочу стати сертифікованим спеціалістом W3C, оскільки це сертифікація гарантує, що я буду мати достатні знання для створення веб-сайтів, які дотримуються стандартів. Це допоможе мені зрозуміти найкращі практики розробки та забезпечити те, що мої веб-сайти будуть працювати на різних платформах та браузерах.",
  test1: {
    t1: "Тест1",
    t2: "Тест2",
  },
};

const App = () => {
  return (
    <div>
      <header id="header">
        <h1>
          {data.surname} {data.name}
        </h1>
        <p>Напрямок за яким планую розвиватиcь: {data.direction}</p>
        <p>
          Персональна сертифікацію яку планую складати: {data.certification}
        </p>
        <p>Аргументація чому саме ця сертифікація: {data.argumentation}</p>
        <p>Тест: {data.test1.t1}</p>
        {/* Якщо передавати данні без знаків питання то буде помилка */}
        <p>Тест фічі Optional Chaining №1: {data?.test2?.t1}</p>
        <p>
          Тест фічі Optional Chaining №2:{" "}
          {data?.test2?.t2 || "Тест не знайдено"}
        </p>
      </header>
      <footer id="footer">
        <p>Барановський Даніїл ІПЗ-20-3</p>
      </footer>
    </div>
  );
};

export default App;
